import Accordion from "react-bootstrap/Accordion";

function Terms() {
    return (
        <Accordion>
            <Accordion.Item eventKey="0">
                <Accordion.Header>이용약관 제 1장 총칙</Accordion.Header>
                <Accordion.Body>
                    제 1 조 (목적) 이 이용약관은 “SWAP (이하 "당 사이트")”에서 제공하는 인터넷 서비스(이하 '서비스')의 가입조건, 당 사이트와 이용자의 권리,
                    의무, 책임사항과 기타 필요한 사항을 규정함을 목적으로 합니다.
                </Accordion.Body>
            </Accordion.Item>
            <Accordion.Item eventKey="1">
                <Accordion.Header>이용약관 제 2장 이용계약의 체결</Accordion.Header>
                <Accordion.Body>
                    <li> "이용자"라 함은 당 사이트에 접속하여 이 약관에 따라 당 사이트가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.</li>
                    <li>“SWAP”에서 제공하는 국가표준, 인증제도, 기술기준, 인증지원 정보를 말합니다.</li>
                    <li>"회원"이라 함은 서비스를 이용하기 위하여 당 사이트에 개인정보를 제공하여 아이디(ID)와 비밀번호를 부여 받은 자를 말합니다.</li>
                    <li>“비회원”이하 함은 회원으로 가입하지 않고 " SWAP"에서 제공하는 서비스를 이용하는 자를 말합니다.</li>
                    <li>"회원 아이디(ID)"라 함은 회원의 식별 및 서비스 이용을 위하여 자신이 선정한 문자 및 숫자의 조합을 말합니다.</li>
                    <li>
                        "비밀번호"라 함은 회원이 자신의 개인정보 및 직접 작성한 비공개 콘텐츠의 보호를 위하여 선정한 문자, 숫자 및 특수문자의 조합을 말합니다.
                    </li>
                </Accordion.Body>
            </Accordion.Item>
            <Accordion.Item eventKey="2">
                <Accordion.Header>이용약관 제 3장 당사자의 의무</Accordion.Header>
                <Accordion.Body>
                    <li> "이용자"라 함은 당 사이트에 접속하여 이 약관에 따라 당 사이트가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.</li>
                    <li>“SWAP”에서 제공하는 국가표준, 인증제도, 기술기준, 인증지원 정보를 말합니다.</li>
                    <li>"회원"이라 함은 서비스를 이용하기 위하여 당 사이트에 개인정보를 제공하여 아이디(ID)와 비밀번호를 부여 받은 자를 말합니다.</li>
                    <li>“비회원”이하 함은 회원으로 가입하지 않고 " SWAP"에서 제공하는 서비스를 이용하는 자를 말합니다.</li>
                    <li>"회원 아이디(ID)"라 함은 회원의 식별 및 서비스 이용을 위하여 자신이 선정한 문자 및 숫자의 조합을 말합니다.</li>
                    <li>
                        "비밀번호"라 함은 회원이 자신의 개인정보 및 직접 작성한 비공개 콘텐츠의 보호를 위하여 선정한 문자, 숫자 및 특수문자의 조합을 말합니다.
                    </li>
                </Accordion.Body>
            </Accordion.Item>
            <Accordion.Item eventKey="3">
                <Accordion.Header>이용약관 제 4장 서비스의 이용</Accordion.Header>
                <Accordion.Body>
                    <li> "이용자"라 함은 당 사이트에 접속하여 이 약관에 따라 당 사이트가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.</li>
                    <li>“SWAP”에서 제공하는 국가표준, 인증제도, 기술기준, 인증지원 정보를 말합니다.</li>
                    <li>"회원"이라 함은 서비스를 이용하기 위하여 당 사이트에 개인정보를 제공하여 아이디(ID)와 비밀번호를 부여 받은 자를 말합니다.</li>
                    <li>“비회원”이하 함은 회원으로 가입하지 않고 " SWAP"에서 제공하는 서비스를 이용하는 자를 말합니다.</li>
                    <li>"회원 아이디(ID)"라 함은 회원의 식별 및 서비스 이용을 위하여 자신이 선정한 문자 및 숫자의 조합을 말합니다.</li>
                    <li>
                        "비밀번호"라 함은 회원이 자신의 개인정보 및 직접 작성한 비공개 콘텐츠의 보호를 위하여 선정한 문자, 숫자 및 특수문자의 조합을 말합니다.
                    </li>
                </Accordion.Body>
            </Accordion.Item>
            <Accordion.Item eventKey="4">
                <Accordion.Header>이용약관 제 5장 계약 해지 및 이용 제한</Accordion.Header>
                <Accordion.Body>
                    <li> "이용자"라 함은 당 사이트에 접속하여 이 약관에 따라 당 사이트가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.</li>
                    <li>“SWAP”에서 제공하는 국가표준, 인증제도, 기술기준, 인증지원 정보를 말합니다.</li>
                    <li>"회원"이라 함은 서비스를 이용하기 위하여 당 사이트에 개인정보를 제공하여 아이디(ID)와 비밀번호를 부여 받은 자를 말합니다.</li>
                    <li>“비회원”이하 함은 회원으로 가입하지 않고 " SWAP"에서 제공하는 서비스를 이용하는 자를 말합니다.</li>
                    <li>"회원 아이디(ID)"라 함은 회원의 식별 및 서비스 이용을 위하여 자신이 선정한 문자 및 숫자의 조합을 말합니다.</li>
                    <li>
                        "비밀번호"라 함은 회원이 자신의 개인정보 및 직접 작성한 비공개 콘텐츠의 보호를 위하여 선정한 문자, 숫자 및 특수문자의 조합을 말합니다.
                    </li>
                </Accordion.Body>
            </Accordion.Item>
            <Accordion.Item eventKey="5">
                <Accordion.Header>이용약관 제 6장 손해배상 및 기타사항</Accordion.Header>
                <Accordion.Body>
                    <li> "이용자"라 함은 당 사이트에 접속하여 이 약관에 따라 당 사이트가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.</li>
                    <li>“SWAP”에서 제공하는 국가표준, 인증제도, 기술기준, 인증지원 정보를 말합니다.</li>
                    <li>"회원"이라 함은 서비스를 이용하기 위하여 당 사이트에 개인정보를 제공하여 아이디(ID)와 비밀번호를 부여 받은 자를 말합니다.</li>
                    <li>“비회원”이하 함은 회원으로 가입하지 않고 " SWAP"에서 제공하는 서비스를 이용하는 자를 말합니다.</li>
                    <li>"회원 아이디(ID)"라 함은 회원의 식별 및 서비스 이용을 위하여 자신이 선정한 문자 및 숫자의 조합을 말합니다.</li>
                    <li>
                        "비밀번호"라 함은 회원이 자신의 개인정보 및 직접 작성한 비공개 콘텐츠의 보호를 위하여 선정한 문자, 숫자 및 특수문자의 조합을 말합니다.
                    </li>
                </Accordion.Body>
            </Accordion.Item>
        </Accordion>
    );
}

export default Terms;
